app/views/articles/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :categories1 %><br />
    <%= f.collection_check_boxes :category_ids, Category.all, :id, :name do |cb| %>

SELECT "categories".* FROM "categories"
---
    <%= f.label :categories2 %><br />
    <% for category in Category.all %>