app/views/articles/index.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1  [["article_id", 1]]
SELECT 1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1 LIMIT $2  [["article_id", 1], ["LIMIT", 1]]
---
	                           Last updated: <%= time_ago_in_words(article.updated_at) %> ago</small></p>
      <% if article.categories.any? %>
      <p>Categories:
	    	<% article.categories.each do |categories| %>