app/views/articles/show.html.erb


<% if @article.categories.any? %>
  <p>Categories:
		<% @article.categories.each do |categories| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1  [["article_id", 1]]
SELECT 1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1 LIMIT $2  [["article_id", 1], ["LIMIT", 1]]