app/views/users/index.html.erb

  <p><%= link_to user.fullname, user_path(user) %></p>
  <p>Articles: <%= user.articles.count %></p>
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]