app/views/users/show.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]
---
<p><%= @user.fullname %></p>
<p>Articles: <%= @user.articles.count %></p>