app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @article = Article.new(article_params)
    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "description" = $1, "updated_at" = $2 WHERE "articles"."id" = $3
---
  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)