app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(page: params[:page], per_page: 2)
---
SELECT "articles".* FROM "articles" LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"