app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"
---
  def index
    @categories = Category.paginate(page: params[:page], per_page: 2)

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = $1 LIMIT $2 OFFSET $3  [["category_id", 5], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = $1  [["category_id", 5]]
---
  def show
    @category = Category.find(params[:id])
    @category_articles = @category.articles.paginate(page: params[:page], )