app/controllers/users_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.includes(:articles).find(params[:id])