app/views/layouts/_header.html.erb

          <li><%= link_to "All Categories", categories_path, class: "nav-link text-dark" %></li>
          <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"